[
   {
      "_id": "thousand-gestures",
      "title": "A Thousand Gestures",
      "year": "2024",
      "category": "solo exhibition",
      "material": "GlogauAIR, Berlin",
      "description": "The exhibition conceived as a place of interaction and contact, and was created in close collaboration with the artists in residence at GlogauAIR in Berlin between January and March 2024. The soft sculptures, which lie on the floor of the exhibition space, invite visitors to stop for a hug and cuddle. The artists in residence acted as models for the photos and collaborated in making the forms of the sculptures in collective sewing sessions. The video work follows the same concept of community creation, involving the artists in the online residency. The voices of the artists are captured through intimate interviews, exploring the role of touch in both personal and professional contexts. Through this collective narrative, the video invites viewers to contemplate the impact of physical touch on our sense of self and interpersonal relationships.",
      "details": "The project was supported by Memoria Artística Chema Alvargonzalez. Thanks for the help and contribution from Aariya Talcherkar, Anji Lesourne, Bianca Durrant, Camilla Marinoni, Cassandra Paige, Cynthia Chou, Dae, Duaa Bilbeisi, Elisa Pardo Puch, Ella Brew, Florencia Galecio, Getsay, Hilal Shamsaldain, Jacqueline Huskisson, Jacopo Petenello, João Motta Guedes, Jo Watson, Josefina Vidal Díaz, Maddie Baker, Marte Conesa, Michal Častulik, Nicholas Ferguson, Nina Criswell, Raisa Desypri, Raquel Gonzalez Obregon, Shannon Castor, Sergei Kurek, Suzy Royal, Tiffany Adler, Tomas Kajurov, Valentine Bossert.",
      "credits": [],
      "image": "../../images/img15.png",
      "img1": "../../images/gestures1/gestures001.jpg",
      "img2": "../../images/gestures1/gestures002.jpg",
      "img3": "../../images/gestures1/gestures003.jpg",
      "img4": "../../images/gestures1/gestures004.jpg",
      "img5": "../../images/gestures1/gestures005.jpg",
      "img6": "../../images/gestures1/gestures006.jpg",
      "img7": "../../images/gestures1/gestures007.jpg"
   },
   {
      "_id": "thousand-gestures-sewing",
      "title": "A Thousand Gestures: Sewing Circles",
      "year": "2023",
      "category": "workshops",
      "material": "GlogauAIR, Berlin",
      "description": "Between January and March 2024, several sewing workshops were held at GlogauAIR in Berlin as part of the exhibition project 'A Thousand Gestures'. The first workshops with the artists-in-residence served to develop the interactive works to be presented at the opening of the show. During the course of the exhibition, a further workshop allowed visitors to add their own contribution to the installation. The gallery space became an opportunity for confrontation and collective work. The bodies that animated the space during the sewing sessions left a trace of themselves until the conclusion of the exhibition. The fabrics will then be used for other projects, accumulating interventions from different people, in a continuous evolving process.",
      "details": "Workshops presented at GlogauAIR Project Space in Berlin. Part of 'A Thousand Gestures', an exhibition and public programme curated by Suzy Royal. The project was supported by Memoria Artística Chema Alvargonzalez.",
      "credits": [],
      "image": "../../images/img14.png",
      "img1": "../../images/gestures2/gestures001.jpg",
      "img2": "../../images/gestures2/gestures002.jpg",
      "img3": "../../images/gestures2/gestures003.jpg",
      "img4": "../../images/gestures2/gestures004.jpg",
      "img5": "../../images/gestures2/gestures005.jpg",
      "img6": "../../images/gestures2/gestures006.jpg",
      "img7": "../../images/gestures2/gestures007.jpg"
   },
   {
      "_id": "nest",
      "title": "Nest: Sewing Circle",
      "year": "2023",
      "category": "installation",
      "material": "sublimation print on microfibre, polyester filling",
      "description": "This workshop aims to imagine the body as a collective entity that we can construct, deconstruct and reconstruct together. Participants are challenged to see themselves as a human community instead of singular individuals, a community represented as a single body composed of multiple elements. They are invited to use my working materials and fabrics and create an interactive installation, with which the audience can interact. The collaborative artworks by Elen Alien, Chiara Caruso, Sofia Dimitrova, Nicole Fischer, Varis Lis, Antonios Michas and Kanella Petropoulou have been exhibited in Backhaus Projects in Berlin.",
      "details": "Workshop presented on 11.11.23 at Backhaus Projects in Berlin. Part of 'Objects of Care', an exhibition and public programme curated by Astro collective.",
      "credits": [],
      "image": "../../images/img13.png",
      "img1": "../../images/nest/nest01.jpeg",
      "img2": "../../images/nest/nest02.jpeg",
      "img3": "../../images/nest/nest03.jpeg",
      "img4": "../../images/nest/nest04.jpeg",
      "img5": "../../images/nest/nest05.jpeg",
      "img6": "../../images/nest/nest06.jpeg",
      "img7": "../../images/nest/nest07.jpeg"
   },
   {
      "_id": "sewing-circle",
      "title": "Shoulder to Shoulder: Sewing Circle",
      "year": "2023",
      "category": "installation",
      "material": "sublimation print on microfibre, polyester filling",
      "description": "During the participatory workshop 'Shoulder to Shoulder', art workers living in Helsinki were invited to participate in a sewing circle where they had the opportunity to connect  the threads of their personal experiences regarding the precarity and insecurity of art work, mental health issues and bodies, and strategies of resistance and survival. The artists were given a platform to actively engage with my work materials by creating new sculptures. The collaborative artworks by Cynthia Blanchette, Ania Duldiier, Jon Dunn, Moe Louanjli, Ines Montalvao, Mathilde Palenius, Cami Ruohonen and Kamila Śladowska have been exhibited in Myymälä2 Gallery in Helsinki.",
      "details": "Workshop presented on 28.06.23 at Töölö library in Helsinki. Part of 'On the Texture of Feelings', an exhibition and public programme hosted by Myymälä2 Gallery and curated by Dare to Care collective. The project was supported by Culture Moves Europe, funded by the European Union and implemented by the Goethe-Institut, and TelepART Mobility Support, run by the Finnish Cultural and Research Institutes.",
      "credits": [],
      "image": "../../images/img11.png",
      "img1": "../../images/sewing/sewing001.jpeg",
      "img2": "../../images/sewing/sewing002.jpeg",
      "img3": "../../images/sewing/sewing003.jpeg",
      "img4": "../../images/sewing/sewing004.jpeg",
      "img5": "../../images/sewing/sewing005.jpeg",
      "img6": "../../images/sewing/sewing006.jpeg",
      "img7": "../../images/sewing/sewing007.jpeg",
      "img8": "../../images/sewing/sewing007.jpeg"
   },
   {
      "_id": "costumes-on-pleasure",
      "title": "Screens*Scream*Sex - On Pleasure",
      "year": "2023",
      "category": "wearable sculptures",
      "material": "sublimation print on microfiber, polyester filling",
      "description": "This performance focuses on the theme of pleasure in its broadest sense. It develops around a series of interviews  in which friends of the artists were asked to talk about the last time they experienced pleasure and to explain the physical sensations associated with it. The answers punctuate the tempo of the performance and the pace of the movements. 'Screens*Scream*Sex' explores choreographies that evoke moments of intimacy in a collective encounter on stage. Through the creation and realisation of different screens and live filming, as well as costumes, it becomes unclear where a body begins or ends and how bodies relate to each other.",
      "details": "'Screens*Scream*Sex - On Pleasure' (50 min, English) by Isadora Alves, Salphinah Savin, Catherin Schöberl und Emilymary Whitaker presented on 24.03.23 at Zentralwäscherei, Zürich, Switzerland.",
      "credits": ["All photo credits to Giovanna León."],
      "image": "../../images/img09.png",
      "img1": "../../images/costumes1/costumes001.jpeg",
      "img2": "../../images/costumes1/costumes002.jpeg",
      "img3": "../../images/costumes1/costumes003.jpeg",
      "img4": "../../images/costumes1/costumes004.jpeg",
      "img5": "../../images/costumes1/costumes005.jpeg",
      "img6": "../../images/costumes1/costumes006.jpeg",
      "img7": "../../images/costumes1/costumes007.jpeg"
   },
   {
      "_id": "costumes-reharsal",
      "title": "Screens*Scream*Sex - Public Rehearsal",
      "year": "2023",
      "category": "wearable sculptures",
      "material": "sublimation print on microfiber, polyester filling",
      "description": "As part of 'The Nights of the Smiling Moons' at the Fondation Beyeler, interactive and participatory public rehearsals of the performance 'Screens*Scream*Sex' were held. The public was invited to listen, follow and create their own movements in relation to the idea of finding pleasure through (un)guided body movements.",
      "details": "'Screens*Scream*Sex - Public Rehearsal' (25 min, English) by Isadora Alves, Salphinah Savin, Catherin Schöberl und Emilymary Whitaker presented on 14.04.23 at Fondation Beyeler, Riehen, Switzerland.",
      "credits": ["All photo credits to Giovanna León."],
      "image": "../../images/img10.png",
      "img1": "../../images/costumes2/costumes001.jpeg",
      "img2": "../../images/costumes2/costumes002.jpeg",
      "img3": "../../images/costumes2/costumes003.jpeg",
      "img4": "../../images/costumes2/costumes004.jpeg",
      "img5": "../../images/costumes2/costumes005.jpeg",
      "img6": "../../images/costumes2/costumes006.jpeg",
      "img7": "../../images/costumes2/costumes007.jpeg"
   },
   {
      "_id": "melting-times",
      "title": "Embrace The Melting Times",
      "year": "2020",
      "category": "fictional story and video",
      "measurement": "9'22''",
      "link": "https://vimeo.com/419281585",
      "description": "The video work presents a short story that is partly autobiographical and partly fictional. It is a first-person narrative of the experience of a liquid, amorphous and ever-changing body. A body that is not only subject to its changing emotional state, which dictates its structure, but also to the difficulties of coping with everyday challenges such as rain, drinking, dripping and slipping. The audio accompanying the video is a field recording of a voice that is subsequently distorted and muffled, recreating the sensation of being underwater.",
      
      "image": "../../images/img01.png",
      "img1": "../../images/melting/melting01.jpeg",
      "img2": "../../images/melting/melting02.jpeg",
      "img3": "../../images/melting/melting03.jpeg",
      "img4": "../../images/melting/melting04.jpeg",
      "img5": "../../images/melting/melting05.jpeg",
      "img6": "../../images/melting/melting06.jpeg",
      "img7": "../../images/melting/melting07.jpeg"
   },
     {
        "_id": "fear-thirst",
        "title": "We Should Fear Thirst",
        "year": "2019",
        "category": "performance, audio video installation",
        "measurement": "time variable",
        "description": "If there is something we have in common, it is the liquidity of our body. We sustain our existence through physical intimacy and fluid exchange. This embodied hydrological cycle is every time different, although the water we are is always coming from somewhere and moving somewhere else, this water is always new, in its form, rhythm, meaning and potential. In the performance, products of common consumption are donated to represent the absolute essence of the body. The artificial colour and texture of the liquids is apparently not human, but in the drinking process they become part of the cycle. The video component of the work shows my body in contact with different liquids, while a background music with the sounds of my bodily fluids spreads through the gallery space embracing viewers during their visit.",
        "details": "Performance presented at SomoS Art Space, in occasion of “Un/real Desires” on 22.10.19.",
        "credits": ["All photo credits to Kimiya Nik.", "Sountrack by Michal Častulik."],
        "audio": "../../audio/thirst.mp3",
        "image": "../../images/img03.png",
        "img1": "../../images/thirst/thirst01.jpeg",
        "img2": "../../images/thirst/thirst02.jpeg",
        "img3": "../../images/thirst/thirst03.jpeg",
        "img4": "../../images/thirst/thirst04.jpeg",
        "img5": "../../images/thirst/thirst05.jpeg",
        "img6": "../../images/thirst/thirst06.jpeg",
        "img7": "../../images/thirst/thirst07.jpeg"
     },
     {
        "_id": "vivid-impressions",
        "title": "Vivid Impressions",
        "year": "2018",
        "category": "installation",
        "material": "sublimation print on microfiber, polyester and polystyrene filling",
        "description": "An impression can be an effect on the subject's feelings (making an impression), as well as a mark on the subject's surface (leaving an impression). The skin acts as an archive of contact histories, recording past encounters with others. These experiences are recorded on the surface of the body, which nevertheless regenerates, offering new possibilities for interaction. Our surface always remains soft and adaptable and, while keeping us separate from others, mediates our relationship with the outside world. My textile sculptures present the body as a field for play and experimentation, the audience is invited to interact with the sculptures, caressing or squeezing them, and leaving their temporary imprint on them.",
        "image": "../../images/img04.png",
        "img1": "../../images/vivid/vivid01.jpeg",
        "img2": "../../images/vivid/vivid02.jpeg",
        "img3": "../../images/vivid/vivid03.jpeg",
        "img4": "../../images/vivid/vivid04.jpeg",
        "img5": "../../images/vivid/vivid05.jpeg",
        "img6": "../../images/vivid/vivid06.jpeg",
        "img7": "../../images/vivid/vivid07.jpeg"
     },
     {
        "_id": "proximity-distance",
        "title": "A Moment of Greatest Proximity and Greatest Distance",
        "year": "2018",
        "category": "wearable sculptures",
        "material": "acrylic enamel on PVC",
        "link": "https://vimeo.com/291452408",
        "description": "Nouvelle Collection Paris is a platform that showcases wearable artworks. For their 2019 collection I created  a sculptural piece reproducing the silhouette of my body on a 1:1 scale. The skin recreated in this sculptural object is a site of possibility in which the nature of the encounter is established through the process of touching, the models are given a free choice on how to wear and activate the work.",
        "details": "The project has been developed in collaboration with Nouvelle Collection Paris, curated by Sarah Nefissa Belhadjali, and presented at MO.CO. La Panacée, Montpellier, France.",
        "credits": ["Photography: Alex Huanfa Cheng, Romain Moncet.", "Models: Maéva Prigent, Sofia Lautrec."],
        "image": "../../images/img06.png",
        "img1": "../../images/moment/moment01.jpeg",
        "img2": "../../images/moment/moment02.jpeg",
        "img3": "../../images/moment/moment03.jpeg",
        "img4": "../../images/moment/moment04.jpeg",
        "img5": "../../images/moment/moment05.jpeg",
        "img6": "../../images/moment/moment06.jpeg",
        "img7": "../../images/moment/moment07.jpeg"
     },
     {
        "_id": "lonely-girl-phenomenology",
        "title": "Lonely Girl Phenomenology",
        "year": "2017",
        "category": "poem and video",
        "measurement": "7'11''",
        "link": "https://vimeo.com/227574710",
        "description": "In the video I share the social criticism expressed in Chris Kraus' feminist novel “I Love Dick” (1997). In Kraus' partly autobiographical book the married protagonist devotes herself to an obsession with another man. She verbalises her desires in love letters to him. Only in the beginning her words actually address Dick, later she writes them rather in order to express her fantasies, to reify and live them out. This kind of approach was extremely familiar and useful for me in the acceptance of my asexuality: I had to gradually understand that the object of my desires was not a person specifically but desire itself.  The video mixes quotes from Kraus' and my own intimate thoughts to question the true meaning of intimacy and love and how to freely express these aspects of life without being forced to fit into social stereotypes.",
        "image": "../../images/img07.png",
        "img1": "../../images/lonely/lonely01.jpeg",
        "img2": "../../images/lonely/lonely02.jpeg",
        "img3": "../../images/lonely/lonely03.jpeg",
        "img4": "../../images/lonely/lonely04.jpeg",
        "img5": "../../images/lonely/lonely05.jpeg",
        "img6": "../../images/lonely/lonely06.jpeg",
        "img7": "../../images/lonely/lonely07.jpeg"
     }
]